ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_sar.h
/***************************************************************************//**
* \file cyip_sar.h
*
* \brief
* SAR IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_SAR_H_
#define _CYIP_SAR_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                            SAR                                            ================ */
/* =========================================================================================================================== */

#define SAR_SECTION_SIZE            0x00010000UL

/**
  * \brief SAR ADC with Sequencer (SAR)
  */
typedef struct {                                /*!< SAR Structure                                                             */
  __IOM uint32_t CTRL;                          /*!< 0x00000000 Analog control register.                                       */
  __IOM uint32_t SAMPLE_CTRL;                   /*!< 0x00000004 Sample control register.                                       */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t SAMPLE_TIME01;                 /*!< 0x00000010 Sample time specification ST0 and ST1                          */
  __IOM uint32_t SAMPLE_TIME23;                 /*!< 0x00000014 Sample time specification ST2 and ST3                          */
  __IOM uint32_t RANGE_THRES;                   /*!< 0x00000018 Global range detect threshold register.                        */
  __IOM uint32_t RANGE_COND;                    /*!< 0x0000001C Global range detect mode register.                             */
  __IOM uint32_t CHAN_EN;                       /*!< 0x00000020 Enable bits for the channels                                   */
  __IOM uint32_t START_CTRL;                    /*!< 0x00000024 Start control register (firmware trigger).                     */
   __IM uint32_t RESERVED1[22];
  __IOM uint32_t CHAN_CONFIG[16];               /*!< 0x00000080 Channel configuration register.                                */
   __IM uint32_t RESERVED2[16];
   __IM uint32_t CHAN_WORK[16];                 /*!< 0x00000100 Channel working data register                                  */
   __IM uint32_t RESERVED3[16];
   __IM uint32_t CHAN_RESULT[16];               /*!< 0x00000180 Channel result data register                                   */
   __IM uint32_t RESERVED4[16];
   __IM uint32_t CHAN_WORK_UPDATED;             /*!< 0x00000200 Channel working data register 'updated' bits                   */
   __IM uint32_t CHAN_RESULT_UPDATED;           /*!< 0x00000204 Channel result data register 'updated' bits                    */
   __IM uint32_t CHAN_WORK_NEWVALUE;            /*!< 0x00000208 Channel working data register 'new value' bits                 */
   __IM uint32_t CHAN_RESULT_NEWVALUE;          /*!< 0x0000020C Channel result data register 'new value' bits                  */
  __IOM uint32_t INTR;                          /*!< 0x00000210 Interrupt request register.                                    */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000214 Interrupt set request register                                 */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000218 Interrupt mask register.                                       */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000021C Interrupt masked request register                              */
  __IOM uint32_t SATURATE_INTR;                 /*!< 0x00000220 Saturate interrupt request register.                           */
  __IOM uint32_t SATURATE_INTR_SET;             /*!< 0x00000224 Saturate interrupt set request register                        */
  __IOM uint32_t SATURATE_INTR_MASK;            /*!< 0x00000228 Saturate interrupt mask register.                              */
   __IM uint32_t SATURATE_INTR_MASKED;          /*!< 0x0000022C Saturate interrupt masked request register                     */
  __IOM uint32_t RANGE_INTR;                    /*!< 0x00000230 Range detect interrupt request register.                       */
  __IOM uint32_t RANGE_INTR_SET;                /*!< 0x00000234 Range detect interrupt set request register                    */
  __IOM uint32_t RANGE_INTR_MASK;               /*!< 0x00000238 Range detect interrupt mask register.                          */
   __IM uint32_t RANGE_INTR_MASKED;             /*!< 0x0000023C Range interrupt masked request register                        */
   __IM uint32_t INTR_CAUSE;                    /*!< 0x00000240 Interrupt cause register                                       */
   __IM uint32_t RESERVED5[15];
  __IOM uint32_t INJ_CHAN_CONFIG;               /*!< 0x00000280 Injection channel configuration register.                      */
   __IM uint32_t RESERVED6[3];
   __IM uint32_t INJ_RESULT;                    /*!< 0x00000290 Injection channel result register                              */
   __IM uint32_t RESERVED7[3];
   __IM uint32_t STATUS;                        /*!< 0x000002A0 Current status of internal SAR registers (mostly for debug)    */
   __IM uint32_t AVG_STAT;                      /*!< 0x000002A4 Current averaging status (for debug)                           */
   __IM uint32_t RESERVED8[22];
  __IOM uint32_t MUX_SWITCH0;                   /*!< 0x00000300 SARMUX Firmware switch controls                                */
  __IOM uint32_t MUX_SWITCH_CLEAR0;             /*!< 0x00000304 SARMUX Firmware switch control clear                           */
   __IM uint32_t RESERVED9[14];
  __IOM uint32_t MUX_SWITCH_DS_CTRL;            /*!< 0x00000340 SARMUX switch DSI control                                      */
  __IOM uint32_t MUX_SWITCH_SQ_CTRL;            /*!< 0x00000344 SARMUX switch Sar Sequencer control                            */
   __IM uint32_t MUX_SWITCH_STATUS;             /*!< 0x00000348 SARMUX switch status                                           */
   __IM uint32_t RESERVED10[749];
  __IOM uint32_t ANA_TRIM0;                     /*!< 0x00000F00 Analog trim register.                                          */
  __IOM uint32_t ANA_TRIM1;                     /*!< 0x00000F04 Analog trim register.                                          */
} SAR_Type;                                     /*!< Size = 3848 (0xF08)                                                       */


