ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_sar.h
/* =======================================================  SAR.CTRL  ======================================================== */
#define SAR_CTRL_PWR_CTRL_VREF_Pos        (0UL)                 /*!< SAR CTRL: PWR_CTRL_VREF (Bit 0)                           */
#define SAR_CTRL_PWR_CTRL_VREF_Msk        (0x7UL)               /*!< SAR CTRL: PWR_CTRL_VREF (Bitfield-Mask: 0x07)             */
#define SAR_CTRL_VREF_SEL_Pos             (4UL)                 /*!< SAR CTRL: VREF_SEL (Bit 4)                                */
#define SAR_CTRL_VREF_SEL_Msk             (0x70UL)              /*!< SAR CTRL: VREF_SEL (Bitfield-Mask: 0x07)                  */
#define SAR_CTRL_VREF_BYP_CAP_EN_Pos      (7UL)                 /*!< SAR CTRL: VREF_BYP_CAP_EN (Bit 7)                         */
#define SAR_CTRL_VREF_BYP_CAP_EN_Msk      (0x80UL)              /*!< SAR CTRL: VREF_BYP_CAP_EN (Bitfield-Mask: 0x01)           */
#define SAR_CTRL_NEG_SEL_Pos              (9UL)                 /*!< SAR CTRL: NEG_SEL (Bit 9)                                 */
#define SAR_CTRL_NEG_SEL_Msk              (0xe00UL)             /*!< SAR CTRL: NEG_SEL (Bitfield-Mask: 0x07)                   */
#define SAR_CTRL_SAR_HW_CTRL_NEGVREF_Pos  (13UL)                /*!< SAR CTRL: SAR_HW_CTRL_NEGVREF (Bit 13)                    */
#define SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk  (0x2000UL)            /*!< SAR CTRL: SAR_HW_CTRL_NEGVREF (Bitfield-Mask: 0x01)       */
#define SAR_CTRL_COMP_DLY_Pos             (14UL)                /*!< SAR CTRL: COMP_DLY (Bit 14)                               */
#define SAR_CTRL_COMP_DLY_Msk             (0xc000UL)            /*!< SAR CTRL: COMP_DLY (Bitfield-Mask: 0x03)                  */
#define SAR_CTRL_SPARE_Pos                (16UL)                /*!< SAR CTRL: SPARE (Bit 16)                                  */
#define SAR_CTRL_SPARE_Msk                (0xf0000UL)           /*!< SAR CTRL: SPARE (Bitfield-Mask: 0x0f)                     */
#define SAR_CTRL_BOOSTPUMP_EN_Pos         (20UL)                /*!< SAR CTRL: BOOSTPUMP_EN (Bit 20)                           */
#define SAR_CTRL_BOOSTPUMP_EN_Msk         (0x100000UL)          /*!< SAR CTRL: BOOSTPUMP_EN (Bitfield-Mask: 0x01)              */
#define SAR_CTRL_REFBUF_EN_Pos            (21UL)                /*!< SAR CTRL: REFBUF_EN (Bit 21)                              */
#define SAR_CTRL_REFBUF_EN_Msk            (0x200000UL)          /*!< SAR CTRL: REFBUF_EN (Bitfield-Mask: 0x01)                 */
#define SAR_CTRL_COMP_PWR_Pos             (24UL)                /*!< SAR CTRL: COMP_PWR (Bit 24)                               */
#define SAR_CTRL_COMP_PWR_Msk             (0x7000000UL)         /*!< SAR CTRL: COMP_PWR (Bitfield-Mask: 0x07)                  */
#define SAR_CTRL_DEEPSLEEP_ON_Pos         (27UL)                /*!< SAR CTRL: DEEPSLEEP_ON (Bit 27)                           */
#define SAR_CTRL_DEEPSLEEP_ON_Msk         (0x8000000UL)         /*!< SAR CTRL: DEEPSLEEP_ON (Bitfield-Mask: 0x01)              */
#define SAR_CTRL_DSI_SYNC_CONFIG_Pos      (28UL)                /*!< SAR CTRL: DSI_SYNC_CONFIG (Bit 28)                        */
#define SAR_CTRL_DSI_SYNC_CONFIG_Msk      (0x10000000UL)        /*!< SAR CTRL: DSI_SYNC_CONFIG (Bitfield-Mask: 0x01)           */
#define SAR_CTRL_DSI_MODE_Pos             (29UL)                /*!< SAR CTRL: DSI_MODE (Bit 29)                               */
#define SAR_CTRL_DSI_MODE_Msk             (0x20000000UL)        /*!< SAR CTRL: DSI_MODE (Bitfield-Mask: 0x01)                  */
#define SAR_CTRL_SWITCH_DISABLE_Pos       (30UL)                /*!< SAR CTRL: SWITCH_DISABLE (Bit 30)                         */
#define SAR_CTRL_SWITCH_DISABLE_Msk       (0x40000000UL)        /*!< SAR CTRL: SWITCH_DISABLE (Bitfield-Mask: 0x01)            */
#define SAR_CTRL_ENABLED_Pos              (31UL)                /*!< SAR CTRL: ENABLED (Bit 31)                                */
#define SAR_CTRL_ENABLED_Msk              (0x80000000UL)        /*!< SAR CTRL: ENABLED (Bitfield-Mask: 0x01)                   */
/* ====================================================  SAR.SAMPLE_CTRL  ==================================================== */
#define SAR_SAMPLE_CTRL_LEFT_ALIGN_Pos    (1UL)                 /*!< SAR SAMPLE_CTRL: LEFT_ALIGN (Bit 1)                       */
#define SAR_SAMPLE_CTRL_LEFT_ALIGN_Msk    (0x2UL)               /*!< SAR SAMPLE_CTRL: LEFT_ALIGN (Bitfield-Mask: 0x01)         */
#define SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos (2UL)           /*!< SAR SAMPLE_CTRL: SINGLE_ENDED_SIGNED (Bit 2)              */
#define SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Msk (0x4UL)         /*!< SAR SAMPLE_CTRL: SINGLE_ENDED_SIGNED (Bitfield-Mask: 0x01)*/
#define SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos (3UL)           /*!< SAR SAMPLE_CTRL: DIFFERENTIAL_SIGNED (Bit 3)              */
#define SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Msk (0x8UL)         /*!< SAR SAMPLE_CTRL: DIFFERENTIAL_SIGNED (Bitfield-Mask: 0x01)*/
#define SAR_SAMPLE_CTRL_AVG_CNT_Pos       (4UL)                 /*!< SAR SAMPLE_CTRL: AVG_CNT (Bit 4)                          */
#define SAR_SAMPLE_CTRL_AVG_CNT_Msk       (0x70UL)              /*!< SAR SAMPLE_CTRL: AVG_CNT (Bitfield-Mask: 0x07)            */
#define SAR_SAMPLE_CTRL_AVG_SHIFT_Pos     (7UL)                 /*!< SAR SAMPLE_CTRL: AVG_SHIFT (Bit 7)                        */
#define SAR_SAMPLE_CTRL_AVG_SHIFT_Msk     (0x80UL)              /*!< SAR SAMPLE_CTRL: AVG_SHIFT (Bitfield-Mask: 0x01)          */
#define SAR_SAMPLE_CTRL_AVG_MODE_Pos      (8UL)                 /*!< SAR SAMPLE_CTRL: AVG_MODE (Bit 8)                         */
#define SAR_SAMPLE_CTRL_AVG_MODE_Msk      (0x100UL)             /*!< SAR SAMPLE_CTRL: AVG_MODE (Bitfield-Mask: 0x01)           */
#define SAR_SAMPLE_CTRL_CONTINUOUS_Pos    (16UL)                /*!< SAR SAMPLE_CTRL: CONTINUOUS (Bit 16)                      */
#define SAR_SAMPLE_CTRL_CONTINUOUS_Msk    (0x10000UL)           /*!< SAR SAMPLE_CTRL: CONTINUOUS (Bitfield-Mask: 0x01)         */
#define SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos (17UL)               /*!< SAR SAMPLE_CTRL: DSI_TRIGGER_EN (Bit 17)                  */
#define SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Msk (0x20000UL)          /*!< SAR SAMPLE_CTRL: DSI_TRIGGER_EN (Bitfield-Mask: 0x01)     */
#define SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Pos (18UL)            /*!< SAR SAMPLE_CTRL: DSI_TRIGGER_LEVEL (Bit 18)               */
#define SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk (0x40000UL)       /*!< SAR SAMPLE_CTRL: DSI_TRIGGER_LEVEL (Bitfield-Mask: 0x01)  */
#define SAR_SAMPLE_CTRL_DSI_SYNC_TRIGGER_Pos (19UL)             /*!< SAR SAMPLE_CTRL: DSI_SYNC_TRIGGER (Bit 19)                */
#define SAR_SAMPLE_CTRL_DSI_SYNC_TRIGGER_Msk (0x80000UL)        /*!< SAR SAMPLE_CTRL: DSI_SYNC_TRIGGER (Bitfield-Mask: 0x01)   */
#define SAR_SAMPLE_CTRL_UAB_SCAN_MODE_Pos (22UL)                /*!< SAR SAMPLE_CTRL: UAB_SCAN_MODE (Bit 22)                   */
#define SAR_SAMPLE_CTRL_UAB_SCAN_MODE_Msk (0x400000UL)          /*!< SAR SAMPLE_CTRL: UAB_SCAN_MODE (Bitfield-Mask: 0x01)      */
#define SAR_SAMPLE_CTRL_REPEAT_INVALID_Pos (23UL)               /*!< SAR SAMPLE_CTRL: REPEAT_INVALID (Bit 23)                  */
#define SAR_SAMPLE_CTRL_REPEAT_INVALID_Msk (0x800000UL)         /*!< SAR SAMPLE_CTRL: REPEAT_INVALID (Bitfield-Mask: 0x01)     */
#define SAR_SAMPLE_CTRL_VALID_SEL_Pos     (24UL)                /*!< SAR SAMPLE_CTRL: VALID_SEL (Bit 24)                       */
#define SAR_SAMPLE_CTRL_VALID_SEL_Msk     (0x7000000UL)         /*!< SAR SAMPLE_CTRL: VALID_SEL (Bitfield-Mask: 0x07)          */
#define SAR_SAMPLE_CTRL_VALID_SEL_EN_Pos  (27UL)                /*!< SAR SAMPLE_CTRL: VALID_SEL_EN (Bit 27)                    */
#define SAR_SAMPLE_CTRL_VALID_SEL_EN_Msk  (0x8000000UL)         /*!< SAR SAMPLE_CTRL: VALID_SEL_EN (Bitfield-Mask: 0x01)       */
#define SAR_SAMPLE_CTRL_VALID_IGNORE_Pos  (28UL)                /*!< SAR SAMPLE_CTRL: VALID_IGNORE (Bit 28)                    */
#define SAR_SAMPLE_CTRL_VALID_IGNORE_Msk  (0x10000000UL)        /*!< SAR SAMPLE_CTRL: VALID_IGNORE (Bitfield-Mask: 0x01)       */
#define SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_Pos (30UL)               /*!< SAR SAMPLE_CTRL: TRIGGER_OUT_EN (Bit 30)                  */
#define SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_Msk (0x40000000UL)       /*!< SAR SAMPLE_CTRL: TRIGGER_OUT_EN (Bitfield-Mask: 0x01)     */
#define SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Pos (31UL)               /*!< SAR SAMPLE_CTRL: EOS_DSI_OUT_EN (Bit 31)                  */
#define SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk (0x80000000UL)       /*!< SAR SAMPLE_CTRL: EOS_DSI_OUT_EN (Bitfield-Mask: 0x01)     */
/* ===================================================  SAR.SAMPLE_TIME01  =================================================== */
#define SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos (0UL)                /*!< SAR SAMPLE_TIME01: SAMPLE_TIME0 (Bit 0)                   */
#define SAR_SAMPLE_TIME01_SAMPLE_TIME0_Msk (0x3ffUL)            /*!< SAR SAMPLE_TIME01: SAMPLE_TIME0 (Bitfield-Mask: 0x3ff)    */
#define SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos (16UL)               /*!< SAR SAMPLE_TIME01: SAMPLE_TIME1 (Bit 16)                  */
#define SAR_SAMPLE_TIME01_SAMPLE_TIME1_Msk (0x3ff0000UL)        /*!< SAR SAMPLE_TIME01: SAMPLE_TIME1 (Bitfield-Mask: 0x3ff)    */
/* ===================================================  SAR.SAMPLE_TIME23  =================================================== */
#define SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos (0UL)                /*!< SAR SAMPLE_TIME23: SAMPLE_TIME2 (Bit 0)                   */
#define SAR_SAMPLE_TIME23_SAMPLE_TIME2_Msk (0x3ffUL)            /*!< SAR SAMPLE_TIME23: SAMPLE_TIME2 (Bitfield-Mask: 0x3ff)    */
#define SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos (16UL)               /*!< SAR SAMPLE_TIME23: SAMPLE_TIME3 (Bit 16)                  */
#define SAR_SAMPLE_TIME23_SAMPLE_TIME3_Msk (0x3ff0000UL)        /*!< SAR SAMPLE_TIME23: SAMPLE_TIME3 (Bitfield-Mask: 0x3ff)    */
/* ====================================================  SAR.RANGE_THRES  ==================================================== */
#define SAR_RANGE_THRES_RANGE_LOW_Pos     (0UL)                 /*!< SAR RANGE_THRES: RANGE_LOW (Bit 0)                        */
#define SAR_RANGE_THRES_RANGE_LOW_Msk     (0xffffUL)            /*!< SAR RANGE_THRES: RANGE_LOW (Bitfield-Mask: 0xffff)        */
#define SAR_RANGE_THRES_RANGE_HIGH_Pos    (16UL)                /*!< SAR RANGE_THRES: RANGE_HIGH (Bit 16)                      */
#define SAR_RANGE_THRES_RANGE_HIGH_Msk    (0xffff0000UL)        /*!< SAR RANGE_THRES: RANGE_HIGH (Bitfield-Mask: 0xffff)       */
/* ====================================================  SAR.RANGE_COND  ===================================================== */
#define SAR_RANGE_COND_RANGE_COND_Pos     (30UL)                /*!< SAR RANGE_COND: RANGE_COND (Bit 30)                       */
#define SAR_RANGE_COND_RANGE_COND_Msk     (0xc0000000UL)        /*!< SAR RANGE_COND: RANGE_COND (Bitfield-Mask: 0x03)          */
/* ======================================================  SAR.CHAN_EN  ====================================================== */
#define SAR_CHAN_EN_CHAN_EN_Pos           (0UL)                 /*!< SAR CHAN_EN: CHAN_EN (Bit 0)                              */
#define SAR_CHAN_EN_CHAN_EN_Msk           (0xffffUL)            /*!< SAR CHAN_EN: CHAN_EN (Bitfield-Mask: 0xffff)              */
/* ====================================================  SAR.START_CTRL  ===================================================== */
#define SAR_START_CTRL_FW_TRIGGER_Pos     (0UL)                 /*!< SAR START_CTRL: FW_TRIGGER (Bit 0)                        */
#define SAR_START_CTRL_FW_TRIGGER_Msk     (0x1UL)               /*!< SAR START_CTRL: FW_TRIGGER (Bitfield-Mask: 0x01)          */
/* ====================================================  SAR.CHAN_CONFIG  ==================================================== */
#define SAR_CHAN_CONFIG_POS_PIN_ADDR_Pos  (0UL)                 /*!< SAR CHAN_CONFIG: POS_PIN_ADDR (Bit 0)                     */
#define SAR_CHAN_CONFIG_POS_PIN_ADDR_Msk  (0x7UL)               /*!< SAR CHAN_CONFIG: POS_PIN_ADDR (Bitfield-Mask: 0x07)       */
#define SAR_CHAN_CONFIG_POS_PORT_ADDR_Pos (4UL)                 /*!< SAR CHAN_CONFIG: POS_PORT_ADDR (Bit 4)                    */
#define SAR_CHAN_CONFIG_POS_PORT_ADDR_Msk (0x70UL)              /*!< SAR CHAN_CONFIG: POS_PORT_ADDR (Bitfield-Mask: 0x07)      */
#define SAR_CHAN_CONFIG_DIFFERENTIAL_EN_Pos (8UL)               /*!< SAR CHAN_CONFIG: DIFFERENTIAL_EN (Bit 8)                  */
#define SAR_CHAN_CONFIG_DIFFERENTIAL_EN_Msk (0x100UL)           /*!< SAR CHAN_CONFIG: DIFFERENTIAL_EN (Bitfield-Mask: 0x01)    */
#define SAR_CHAN_CONFIG_AVG_EN_Pos        (10UL)                /*!< SAR CHAN_CONFIG: AVG_EN (Bit 10)                          */
#define SAR_CHAN_CONFIG_AVG_EN_Msk        (0x400UL)             /*!< SAR CHAN_CONFIG: AVG_EN (Bitfield-Mask: 0x01)             */
#define SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Pos (12UL)              /*!< SAR CHAN_CONFIG: SAMPLE_TIME_SEL (Bit 12)                 */
#define SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Msk (0x3000UL)          /*!< SAR CHAN_CONFIG: SAMPLE_TIME_SEL (Bitfield-Mask: 0x03)    */
#define SAR_CHAN_CONFIG_NEG_PIN_ADDR_Pos  (16UL)                /*!< SAR CHAN_CONFIG: NEG_PIN_ADDR (Bit 16)                    */
#define SAR_CHAN_CONFIG_NEG_PIN_ADDR_Msk  (0x70000UL)           /*!< SAR CHAN_CONFIG: NEG_PIN_ADDR (Bitfield-Mask: 0x07)       */
#define SAR_CHAN_CONFIG_NEG_PORT_ADDR_Pos (20UL)                /*!< SAR CHAN_CONFIG: NEG_PORT_ADDR (Bit 20)                   */
#define SAR_CHAN_CONFIG_NEG_PORT_ADDR_Msk (0x700000UL)          /*!< SAR CHAN_CONFIG: NEG_PORT_ADDR (Bitfield-Mask: 0x07)      */
#define SAR_CHAN_CONFIG_NEG_ADDR_EN_Pos   (24UL)                /*!< SAR CHAN_CONFIG: NEG_ADDR_EN (Bit 24)                     */
#define SAR_CHAN_CONFIG_NEG_ADDR_EN_Msk   (0x1000000UL)         /*!< SAR CHAN_CONFIG: NEG_ADDR_EN (Bitfield-Mask: 0x01)        */
#define SAR_CHAN_CONFIG_DSI_OUT_EN_Pos    (31UL)                /*!< SAR CHAN_CONFIG: DSI_OUT_EN (Bit 31)                      */
#define SAR_CHAN_CONFIG_DSI_OUT_EN_Msk    (0x80000000UL)        /*!< SAR CHAN_CONFIG: DSI_OUT_EN (Bitfield-Mask: 0x01)         */
/* =====================================================  SAR.CHAN_WORK  ===================================================== */
#define SAR_CHAN_WORK_WORK_Pos            (0UL)                 /*!< SAR CHAN_WORK: WORK (Bit 0)                               */
#define SAR_CHAN_WORK_WORK_Msk            (0xffffUL)            /*!< SAR CHAN_WORK: WORK (Bitfield-Mask: 0xffff)               */
#define SAR_CHAN_WORK_CHAN_WORK_NEWVALUE_MIR_Pos (27UL)         /*!< SAR CHAN_WORK: CHAN_WORK_NEWVALUE_MIR (Bit 27)            */
#define SAR_CHAN_WORK_CHAN_WORK_NEWVALUE_MIR_Msk (0x8000000UL)  /*!< SAR CHAN_WORK: CHAN_WORK_NEWVALUE_MIR (Bitfield-Mask: 0x01)*/
#define SAR_CHAN_WORK_CHAN_WORK_UPDATED_MIR_Pos (31UL)          /*!< SAR CHAN_WORK: CHAN_WORK_UPDATED_MIR (Bit 31)             */
#define SAR_CHAN_WORK_CHAN_WORK_UPDATED_MIR_Msk (0x80000000UL)  /*!< SAR CHAN_WORK: CHAN_WORK_UPDATED_MIR (Bitfield-Mask: 0x01)*/
/* ====================================================  SAR.CHAN_RESULT  ==================================================== */
#define SAR_CHAN_RESULT_RESULT_Pos        (0UL)                 /*!< SAR CHAN_RESULT: RESULT (Bit 0)                           */
#define SAR_CHAN_RESULT_RESULT_Msk        (0xffffUL)            /*!< SAR CHAN_RESULT: RESULT (Bitfield-Mask: 0xffff)           */
#define SAR_CHAN_RESULT_CHAN_RESULT_NEWVALUE_MIR_Pos (27UL)     /*!< SAR CHAN_RESULT: CHAN_RESULT_NEWVALUE_MIR (Bit 27)        */
#define SAR_CHAN_RESULT_CHAN_RESULT_NEWVALUE_MIR_Msk (0x8000000UL) /*!< SAR CHAN_RESULT: CHAN_RESULT_NEWVALUE_MIR (Bitfield-Mask: 0x01)*/
#define SAR_CHAN_RESULT_SATURATE_INTR_MIR_Pos (29UL)            /*!< SAR CHAN_RESULT: SATURATE_INTR_MIR (Bit 29)               */
#define SAR_CHAN_RESULT_SATURATE_INTR_MIR_Msk (0x20000000UL)    /*!< SAR CHAN_RESULT: SATURATE_INTR_MIR (Bitfield-Mask: 0x01)  */
#define SAR_CHAN_RESULT_RANGE_INTR_MIR_Pos (30UL)               /*!< SAR CHAN_RESULT: RANGE_INTR_MIR (Bit 30)                  */
#define SAR_CHAN_RESULT_RANGE_INTR_MIR_Msk (0x40000000UL)       /*!< SAR CHAN_RESULT: RANGE_INTR_MIR (Bitfield-Mask: 0x01)     */
#define SAR_CHAN_RESULT_CHAN_RESULT_UPDATED_MIR_Pos (31UL)      /*!< SAR CHAN_RESULT: CHAN_RESULT_UPDATED_MIR (Bit 31)         */
#define SAR_CHAN_RESULT_CHAN_RESULT_UPDATED_MIR_Msk (0x80000000UL) /*!< SAR CHAN_RESULT: CHAN_RESULT_UPDATED_MIR (Bitfield-Mask: 0x01)*/
/* =================================================  SAR.CHAN_WORK_UPDATED  ================================================= */
#define SAR_CHAN_WORK_UPDATED_CHAN_WORK_UPDATED_Pos (0UL)       /*!< SAR CHAN_WORK_UPDATED: CHAN_WORK_UPDATED (Bit 0)          */
#define SAR_CHAN_WORK_UPDATED_CHAN_WORK_UPDATED_Msk (0xffffUL)  /*!< SAR CHAN_WORK_UPDATED: CHAN_WORK_UPDATED (Bitfield-Mask: 0xffff)*/
/* ================================================  SAR.CHAN_RESULT_UPDATED  ================================================ */
#define SAR_CHAN_RESULT_UPDATED_CHAN_RESULT_UPDATED_Pos (0UL)   /*!< SAR CHAN_RESULT_UPDATED: CHAN_RESULT_UPDATED (Bit 0)      */
#define SAR_CHAN_RESULT_UPDATED_CHAN_RESULT_UPDATED_Msk (0xffffUL) /*!< SAR CHAN_RESULT_UPDATED: CHAN_RESULT_UPDATED (Bitfield-Mask: 0xffff)*/
/* ================================================  SAR.CHAN_WORK_NEWVALUE  ================================================= */
#define SAR_CHAN_WORK_NEWVALUE_CHAN_WORK_NEWVALUE_Pos (0UL)     /*!< SAR CHAN_WORK_NEWVALUE: CHAN_WORK_NEWVALUE (Bit 0)        */
#define SAR_CHAN_WORK_NEWVALUE_CHAN_WORK_NEWVALUE_Msk (0xffffUL) /*!< SAR CHAN_WORK_NEWVALUE: CHAN_WORK_NEWVALUE (Bitfield-Mask: 0xffff)*/
/* ===============================================  SAR.CHAN_RESULT_NEWVALUE  ================================================ */
#define SAR_CHAN_RESULT_NEWVALUE_CHAN_RESULT_NEWVALUE_Pos (0UL) /*!< SAR CHAN_RESULT_NEWVALUE: CHAN_RESULT_NEWVALUE (Bit 0)    */
#define SAR_CHAN_RESULT_NEWVALUE_CHAN_RESULT_NEWVALUE_Msk (0xffffUL) /*!< SAR CHAN_RESULT_NEWVALUE: CHAN_RESULT_NEWVALUE (Bitfield-Mask: 0xffff)*/
/* =======================================================  SAR.INTR  ======================================================== */
#define SAR_INTR_EOS_INTR_Pos             (0UL)                 /*!< SAR INTR: EOS_INTR (Bit 0)                                */
#define SAR_INTR_EOS_INTR_Msk             (0x1UL)               /*!< SAR INTR: EOS_INTR (Bitfield-Mask: 0x01)                  */
#define SAR_INTR_OVERFLOW_INTR_Pos        (1UL)                 /*!< SAR INTR: OVERFLOW_INTR (Bit 1)                           */
#define SAR_INTR_OVERFLOW_INTR_Msk        (0x2UL)               /*!< SAR INTR: OVERFLOW_INTR (Bitfield-Mask: 0x01)             */
#define SAR_INTR_FW_COLLISION_INTR_Pos    (2UL)                 /*!< SAR INTR: FW_COLLISION_INTR (Bit 2)                       */
#define SAR_INTR_FW_COLLISION_INTR_Msk    (0x4UL)               /*!< SAR INTR: FW_COLLISION_INTR (Bitfield-Mask: 0x01)         */
#define SAR_INTR_DSI_COLLISION_INTR_Pos   (3UL)                 /*!< SAR INTR: DSI_COLLISION_INTR (Bit 3)                      */
#define SAR_INTR_DSI_COLLISION_INTR_Msk   (0x8UL)               /*!< SAR INTR: DSI_COLLISION_INTR (Bitfield-Mask: 0x01)        */
#define SAR_INTR_INJ_EOC_INTR_Pos         (4UL)                 /*!< SAR INTR: INJ_EOC_INTR (Bit 4)                            */
#define SAR_INTR_INJ_EOC_INTR_Msk         (0x10UL)              /*!< SAR INTR: INJ_EOC_INTR (Bitfield-Mask: 0x01)              */
#define SAR_INTR_INJ_SATURATE_INTR_Pos    (5UL)                 /*!< SAR INTR: INJ_SATURATE_INTR (Bit 5)                       */
#define SAR_INTR_INJ_SATURATE_INTR_Msk    (0x20UL)              /*!< SAR INTR: INJ_SATURATE_INTR (Bitfield-Mask: 0x01)         */
#define SAR_INTR_INJ_RANGE_INTR_Pos       (6UL)                 /*!< SAR INTR: INJ_RANGE_INTR (Bit 6)                          */
#define SAR_INTR_INJ_RANGE_INTR_Msk       (0x40UL)              /*!< SAR INTR: INJ_RANGE_INTR (Bitfield-Mask: 0x01)            */
#define SAR_INTR_INJ_COLLISION_INTR_Pos   (7UL)                 /*!< SAR INTR: INJ_COLLISION_INTR (Bit 7)                      */
#define SAR_INTR_INJ_COLLISION_INTR_Msk   (0x80UL)              /*!< SAR INTR: INJ_COLLISION_INTR (Bitfield-Mask: 0x01)        */
/* =====================================================  SAR.INTR_SET  ====================================================== */
#define SAR_INTR_SET_EOS_SET_Pos          (0UL)                 /*!< SAR INTR_SET: EOS_SET (Bit 0)                             */
#define SAR_INTR_SET_EOS_SET_Msk          (0x1UL)               /*!< SAR INTR_SET: EOS_SET (Bitfield-Mask: 0x01)               */
#define SAR_INTR_SET_OVERFLOW_SET_Pos     (1UL)                 /*!< SAR INTR_SET: OVERFLOW_SET (Bit 1)                        */
#define SAR_INTR_SET_OVERFLOW_SET_Msk     (0x2UL)               /*!< SAR INTR_SET: OVERFLOW_SET (Bitfield-Mask: 0x01)          */
#define SAR_INTR_SET_FW_COLLISION_SET_Pos (2UL)                 /*!< SAR INTR_SET: FW_COLLISION_SET (Bit 2)                    */
#define SAR_INTR_SET_FW_COLLISION_SET_Msk (0x4UL)               /*!< SAR INTR_SET: FW_COLLISION_SET (Bitfield-Mask: 0x01)      */
#define SAR_INTR_SET_DSI_COLLISION_SET_Pos (3UL)                /*!< SAR INTR_SET: DSI_COLLISION_SET (Bit 3)                   */
#define SAR_INTR_SET_DSI_COLLISION_SET_Msk (0x8UL)              /*!< SAR INTR_SET: DSI_COLLISION_SET (Bitfield-Mask: 0x01)     */
#define SAR_INTR_SET_INJ_EOC_SET_Pos      (4UL)                 /*!< SAR INTR_SET: INJ_EOC_SET (Bit 4)                         */
#define SAR_INTR_SET_INJ_EOC_SET_Msk      (0x10UL)              /*!< SAR INTR_SET: INJ_EOC_SET (Bitfield-Mask: 0x01)           */
#define SAR_INTR_SET_INJ_SATURATE_SET_Pos (5UL)                 /*!< SAR INTR_SET: INJ_SATURATE_SET (Bit 5)                    */
#define SAR_INTR_SET_INJ_SATURATE_SET_Msk (0x20UL)              /*!< SAR INTR_SET: INJ_SATURATE_SET (Bitfield-Mask: 0x01)      */
#define SAR_INTR_SET_INJ_RANGE_SET_Pos    (6UL)                 /*!< SAR INTR_SET: INJ_RANGE_SET (Bit 6)                       */
#define SAR_INTR_SET_INJ_RANGE_SET_Msk    (0x40UL)              /*!< SAR INTR_SET: INJ_RANGE_SET (Bitfield-Mask: 0x01)         */
#define SAR_INTR_SET_INJ_COLLISION_SET_Pos (7UL)                /*!< SAR INTR_SET: INJ_COLLISION_SET (Bit 7)                   */
#define SAR_INTR_SET_INJ_COLLISION_SET_Msk (0x80UL)             /*!< SAR INTR_SET: INJ_COLLISION_SET (Bitfield-Mask: 0x01)     */
/* =====================================================  SAR.INTR_MASK  ===================================================== */
#define SAR_INTR_MASK_EOS_MASK_Pos        (0UL)                 /*!< SAR INTR_MASK: EOS_MASK (Bit 0)                           */
#define SAR_INTR_MASK_EOS_MASK_Msk        (0x1UL)               /*!< SAR INTR_MASK: EOS_MASK (Bitfield-Mask: 0x01)             */
#define SAR_INTR_MASK_OVERFLOW_MASK_Pos   (1UL)                 /*!< SAR INTR_MASK: OVERFLOW_MASK (Bit 1)                      */
#define SAR_INTR_MASK_OVERFLOW_MASK_Msk   (0x2UL)               /*!< SAR INTR_MASK: OVERFLOW_MASK (Bitfield-Mask: 0x01)        */
#define SAR_INTR_MASK_FW_COLLISION_MASK_Pos (2UL)               /*!< SAR INTR_MASK: FW_COLLISION_MASK (Bit 2)                  */
#define SAR_INTR_MASK_FW_COLLISION_MASK_Msk (0x4UL)             /*!< SAR INTR_MASK: FW_COLLISION_MASK (Bitfield-Mask: 0x01)    */
#define SAR_INTR_MASK_DSI_COLLISION_MASK_Pos (3UL)              /*!< SAR INTR_MASK: DSI_COLLISION_MASK (Bit 3)                 */
#define SAR_INTR_MASK_DSI_COLLISION_MASK_Msk (0x8UL)            /*!< SAR INTR_MASK: DSI_COLLISION_MASK (Bitfield-Mask: 0x01)   */
#define SAR_INTR_MASK_INJ_EOC_MASK_Pos    (4UL)                 /*!< SAR INTR_MASK: INJ_EOC_MASK (Bit 4)                       */
#define SAR_INTR_MASK_INJ_EOC_MASK_Msk    (0x10UL)              /*!< SAR INTR_MASK: INJ_EOC_MASK (Bitfield-Mask: 0x01)         */
