ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_sar.h
#define SAR_INTR_MASK_INJ_SATURATE_MASK_Pos (5UL)               /*!< SAR INTR_MASK: INJ_SATURATE_MASK (Bit 5)                  */
#define SAR_INTR_MASK_INJ_SATURATE_MASK_Msk (0x20UL)            /*!< SAR INTR_MASK: INJ_SATURATE_MASK (Bitfield-Mask: 0x01)    */
#define SAR_INTR_MASK_INJ_RANGE_MASK_Pos  (6UL)                 /*!< SAR INTR_MASK: INJ_RANGE_MASK (Bit 6)                     */
#define SAR_INTR_MASK_INJ_RANGE_MASK_Msk  (0x40UL)              /*!< SAR INTR_MASK: INJ_RANGE_MASK (Bitfield-Mask: 0x01)       */
#define SAR_INTR_MASK_INJ_COLLISION_MASK_Pos (7UL)              /*!< SAR INTR_MASK: INJ_COLLISION_MASK (Bit 7)                 */
#define SAR_INTR_MASK_INJ_COLLISION_MASK_Msk (0x80UL)           /*!< SAR INTR_MASK: INJ_COLLISION_MASK (Bitfield-Mask: 0x01)   */
/* ====================================================  SAR.INTR_MASKED  ==================================================== */
#define SAR_INTR_MASKED_EOS_MASKED_Pos    (0UL)                 /*!< SAR INTR_MASKED: EOS_MASKED (Bit 0)                       */
#define SAR_INTR_MASKED_EOS_MASKED_Msk    (0x1UL)               /*!< SAR INTR_MASKED: EOS_MASKED (Bitfield-Mask: 0x01)         */
#define SAR_INTR_MASKED_OVERFLOW_MASKED_Pos (1UL)               /*!< SAR INTR_MASKED: OVERFLOW_MASKED (Bit 1)                  */
#define SAR_INTR_MASKED_OVERFLOW_MASKED_Msk (0x2UL)             /*!< SAR INTR_MASKED: OVERFLOW_MASKED (Bitfield-Mask: 0x01)    */
#define SAR_INTR_MASKED_FW_COLLISION_MASKED_Pos (2UL)           /*!< SAR INTR_MASKED: FW_COLLISION_MASKED (Bit 2)              */
#define SAR_INTR_MASKED_FW_COLLISION_MASKED_Msk (0x4UL)         /*!< SAR INTR_MASKED: FW_COLLISION_MASKED (Bitfield-Mask: 0x01)*/
#define SAR_INTR_MASKED_DSI_COLLISION_MASKED_Pos (3UL)          /*!< SAR INTR_MASKED: DSI_COLLISION_MASKED (Bit 3)             */
#define SAR_INTR_MASKED_DSI_COLLISION_MASKED_Msk (0x8UL)        /*!< SAR INTR_MASKED: DSI_COLLISION_MASKED (Bitfield-Mask: 0x01)*/
#define SAR_INTR_MASKED_INJ_EOC_MASKED_Pos (4UL)                /*!< SAR INTR_MASKED: INJ_EOC_MASKED (Bit 4)                   */
#define SAR_INTR_MASKED_INJ_EOC_MASKED_Msk (0x10UL)             /*!< SAR INTR_MASKED: INJ_EOC_MASKED (Bitfield-Mask: 0x01)     */
#define SAR_INTR_MASKED_INJ_SATURATE_MASKED_Pos (5UL)           /*!< SAR INTR_MASKED: INJ_SATURATE_MASKED (Bit 5)              */
#define SAR_INTR_MASKED_INJ_SATURATE_MASKED_Msk (0x20UL)        /*!< SAR INTR_MASKED: INJ_SATURATE_MASKED (Bitfield-Mask: 0x01)*/
#define SAR_INTR_MASKED_INJ_RANGE_MASKED_Pos (6UL)              /*!< SAR INTR_MASKED: INJ_RANGE_MASKED (Bit 6)                 */
#define SAR_INTR_MASKED_INJ_RANGE_MASKED_Msk (0x40UL)           /*!< SAR INTR_MASKED: INJ_RANGE_MASKED (Bitfield-Mask: 0x01)   */
#define SAR_INTR_MASKED_INJ_COLLISION_MASKED_Pos (7UL)          /*!< SAR INTR_MASKED: INJ_COLLISION_MASKED (Bit 7)             */
#define SAR_INTR_MASKED_INJ_COLLISION_MASKED_Msk (0x80UL)       /*!< SAR INTR_MASKED: INJ_COLLISION_MASKED (Bitfield-Mask: 0x01)*/
/* ===================================================  SAR.SATURATE_INTR  =================================================== */
#define SAR_SATURATE_INTR_SATURATE_INTR_Pos (0UL)               /*!< SAR SATURATE_INTR: SATURATE_INTR (Bit 0)                  */
#define SAR_SATURATE_INTR_SATURATE_INTR_Msk (0xffffUL)          /*!< SAR SATURATE_INTR: SATURATE_INTR (Bitfield-Mask: 0xffff)  */
/* =================================================  SAR.SATURATE_INTR_SET  ================================================= */
#define SAR_SATURATE_INTR_SET_SATURATE_SET_Pos (0UL)            /*!< SAR SATURATE_INTR_SET: SATURATE_SET (Bit 0)               */
#define SAR_SATURATE_INTR_SET_SATURATE_SET_Msk (0xffffUL)       /*!< SAR SATURATE_INTR_SET: SATURATE_SET (Bitfield-Mask: 0xffff)*/
/* ================================================  SAR.SATURATE_INTR_MASK  ================================================= */
#define SAR_SATURATE_INTR_MASK_SATURATE_MASK_Pos (0UL)          /*!< SAR SATURATE_INTR_MASK: SATURATE_MASK (Bit 0)             */
#define SAR_SATURATE_INTR_MASK_SATURATE_MASK_Msk (0xffffUL)     /*!< SAR SATURATE_INTR_MASK: SATURATE_MASK (Bitfield-Mask: 0xffff)*/
/* ===============================================  SAR.SATURATE_INTR_MASKED  ================================================ */
#define SAR_SATURATE_INTR_MASKED_SATURATE_MASKED_Pos (0UL)      /*!< SAR SATURATE_INTR_MASKED: SATURATE_MASKED (Bit 0)         */
#define SAR_SATURATE_INTR_MASKED_SATURATE_MASKED_Msk (0xffffUL) /*!< SAR SATURATE_INTR_MASKED: SATURATE_MASKED (Bitfield-Mask: 0xffff)*/
/* ====================================================  SAR.RANGE_INTR  ===================================================== */
#define SAR_RANGE_INTR_RANGE_INTR_Pos     (0UL)                 /*!< SAR RANGE_INTR: RANGE_INTR (Bit 0)                        */
#define SAR_RANGE_INTR_RANGE_INTR_Msk     (0xffffUL)            /*!< SAR RANGE_INTR: RANGE_INTR (Bitfield-Mask: 0xffff)        */
/* ==================================================  SAR.RANGE_INTR_SET  =================================================== */
#define SAR_RANGE_INTR_SET_RANGE_SET_Pos  (0UL)                 /*!< SAR RANGE_INTR_SET: RANGE_SET (Bit 0)                     */
#define SAR_RANGE_INTR_SET_RANGE_SET_Msk  (0xffffUL)            /*!< SAR RANGE_INTR_SET: RANGE_SET (Bitfield-Mask: 0xffff)     */
/* ==================================================  SAR.RANGE_INTR_MASK  ================================================== */
#define SAR_RANGE_INTR_MASK_RANGE_MASK_Pos (0UL)                /*!< SAR RANGE_INTR_MASK: RANGE_MASK (Bit 0)                   */
#define SAR_RANGE_INTR_MASK_RANGE_MASK_Msk (0xffffUL)           /*!< SAR RANGE_INTR_MASK: RANGE_MASK (Bitfield-Mask: 0xffff)   */
/* =================================================  SAR.RANGE_INTR_MASKED  ================================================= */
#define SAR_RANGE_INTR_MASKED_RANGE_MASKED_Pos (0UL)            /*!< SAR RANGE_INTR_MASKED: RANGE_MASKED (Bit 0)               */
#define SAR_RANGE_INTR_MASKED_RANGE_MASKED_Msk (0xffffUL)       /*!< SAR RANGE_INTR_MASKED: RANGE_MASKED (Bitfield-Mask: 0xffff)*/
/* ====================================================  SAR.INTR_CAUSE  ===================================================== */
#define SAR_INTR_CAUSE_EOS_MASKED_MIR_Pos (0UL)                 /*!< SAR INTR_CAUSE: EOS_MASKED_MIR (Bit 0)                    */
#define SAR_INTR_CAUSE_EOS_MASKED_MIR_Msk (0x1UL)               /*!< SAR INTR_CAUSE: EOS_MASKED_MIR (Bitfield-Mask: 0x01)      */
#define SAR_INTR_CAUSE_OVERFLOW_MASKED_MIR_Pos (1UL)            /*!< SAR INTR_CAUSE: OVERFLOW_MASKED_MIR (Bit 1)               */
#define SAR_INTR_CAUSE_OVERFLOW_MASKED_MIR_Msk (0x2UL)          /*!< SAR INTR_CAUSE: OVERFLOW_MASKED_MIR (Bitfield-Mask: 0x01) */
#define SAR_INTR_CAUSE_FW_COLLISION_MASKED_MIR_Pos (2UL)        /*!< SAR INTR_CAUSE: FW_COLLISION_MASKED_MIR (Bit 2)           */
#define SAR_INTR_CAUSE_FW_COLLISION_MASKED_MIR_Msk (0x4UL)      /*!< SAR INTR_CAUSE: FW_COLLISION_MASKED_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INTR_CAUSE_DSI_COLLISION_MASKED_MIR_Pos (3UL)       /*!< SAR INTR_CAUSE: DSI_COLLISION_MASKED_MIR (Bit 3)          */
#define SAR_INTR_CAUSE_DSI_COLLISION_MASKED_MIR_Msk (0x8UL)     /*!< SAR INTR_CAUSE: DSI_COLLISION_MASKED_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INTR_CAUSE_INJ_EOC_MASKED_MIR_Pos (4UL)             /*!< SAR INTR_CAUSE: INJ_EOC_MASKED_MIR (Bit 4)                */
#define SAR_INTR_CAUSE_INJ_EOC_MASKED_MIR_Msk (0x10UL)          /*!< SAR INTR_CAUSE: INJ_EOC_MASKED_MIR (Bitfield-Mask: 0x01)  */
#define SAR_INTR_CAUSE_INJ_SATURATE_MASKED_MIR_Pos (5UL)        /*!< SAR INTR_CAUSE: INJ_SATURATE_MASKED_MIR (Bit 5)           */
#define SAR_INTR_CAUSE_INJ_SATURATE_MASKED_MIR_Msk (0x20UL)     /*!< SAR INTR_CAUSE: INJ_SATURATE_MASKED_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INTR_CAUSE_INJ_RANGE_MASKED_MIR_Pos (6UL)           /*!< SAR INTR_CAUSE: INJ_RANGE_MASKED_MIR (Bit 6)              */
#define SAR_INTR_CAUSE_INJ_RANGE_MASKED_MIR_Msk (0x40UL)        /*!< SAR INTR_CAUSE: INJ_RANGE_MASKED_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INTR_CAUSE_INJ_COLLISION_MASKED_MIR_Pos (7UL)       /*!< SAR INTR_CAUSE: INJ_COLLISION_MASKED_MIR (Bit 7)          */
#define SAR_INTR_CAUSE_INJ_COLLISION_MASKED_MIR_Msk (0x80UL)    /*!< SAR INTR_CAUSE: INJ_COLLISION_MASKED_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INTR_CAUSE_SATURATE_MASKED_RED_Pos (30UL)           /*!< SAR INTR_CAUSE: SATURATE_MASKED_RED (Bit 30)              */
#define SAR_INTR_CAUSE_SATURATE_MASKED_RED_Msk (0x40000000UL)   /*!< SAR INTR_CAUSE: SATURATE_MASKED_RED (Bitfield-Mask: 0x01) */
#define SAR_INTR_CAUSE_RANGE_MASKED_RED_Pos (31UL)              /*!< SAR INTR_CAUSE: RANGE_MASKED_RED (Bit 31)                 */
#define SAR_INTR_CAUSE_RANGE_MASKED_RED_Msk (0x80000000UL)      /*!< SAR INTR_CAUSE: RANGE_MASKED_RED (Bitfield-Mask: 0x01)    */
/* ==================================================  SAR.INJ_CHAN_CONFIG  ================================================== */
#define SAR_INJ_CHAN_CONFIG_INJ_PIN_ADDR_Pos (0UL)              /*!< SAR INJ_CHAN_CONFIG: INJ_PIN_ADDR (Bit 0)                 */
#define SAR_INJ_CHAN_CONFIG_INJ_PIN_ADDR_Msk (0x7UL)            /*!< SAR INJ_CHAN_CONFIG: INJ_PIN_ADDR (Bitfield-Mask: 0x07)   */
#define SAR_INJ_CHAN_CONFIG_INJ_PORT_ADDR_Pos (4UL)             /*!< SAR INJ_CHAN_CONFIG: INJ_PORT_ADDR (Bit 4)                */
#define SAR_INJ_CHAN_CONFIG_INJ_PORT_ADDR_Msk (0x70UL)          /*!< SAR INJ_CHAN_CONFIG: INJ_PORT_ADDR (Bitfield-Mask: 0x07)  */
#define SAR_INJ_CHAN_CONFIG_INJ_DIFFERENTIAL_EN_Pos (8UL)       /*!< SAR INJ_CHAN_CONFIG: INJ_DIFFERENTIAL_EN (Bit 8)          */
#define SAR_INJ_CHAN_CONFIG_INJ_DIFFERENTIAL_EN_Msk (0x100UL)   /*!< SAR INJ_CHAN_CONFIG: INJ_DIFFERENTIAL_EN (Bitfield-Mask: 0x01)*/
#define SAR_INJ_CHAN_CONFIG_INJ_AVG_EN_Pos (10UL)               /*!< SAR INJ_CHAN_CONFIG: INJ_AVG_EN (Bit 10)                  */
#define SAR_INJ_CHAN_CONFIG_INJ_AVG_EN_Msk (0x400UL)            /*!< SAR INJ_CHAN_CONFIG: INJ_AVG_EN (Bitfield-Mask: 0x01)     */
#define SAR_INJ_CHAN_CONFIG_INJ_SAMPLE_TIME_SEL_Pos (12UL)      /*!< SAR INJ_CHAN_CONFIG: INJ_SAMPLE_TIME_SEL (Bit 12)         */
#define SAR_INJ_CHAN_CONFIG_INJ_SAMPLE_TIME_SEL_Msk (0x3000UL)  /*!< SAR INJ_CHAN_CONFIG: INJ_SAMPLE_TIME_SEL (Bitfield-Mask: 0x03)*/
#define SAR_INJ_CHAN_CONFIG_INJ_TAILGATING_Pos (30UL)           /*!< SAR INJ_CHAN_CONFIG: INJ_TAILGATING (Bit 30)              */
#define SAR_INJ_CHAN_CONFIG_INJ_TAILGATING_Msk (0x40000000UL)   /*!< SAR INJ_CHAN_CONFIG: INJ_TAILGATING (Bitfield-Mask: 0x01) */
#define SAR_INJ_CHAN_CONFIG_INJ_START_EN_Pos (31UL)             /*!< SAR INJ_CHAN_CONFIG: INJ_START_EN (Bit 31)                */
#define SAR_INJ_CHAN_CONFIG_INJ_START_EN_Msk (0x80000000UL)     /*!< SAR INJ_CHAN_CONFIG: INJ_START_EN (Bitfield-Mask: 0x01)   */
/* ====================================================  SAR.INJ_RESULT  ===================================================== */
#define SAR_INJ_RESULT_INJ_RESULT_Pos     (0UL)                 /*!< SAR INJ_RESULT: INJ_RESULT (Bit 0)                        */
#define SAR_INJ_RESULT_INJ_RESULT_Msk     (0xffffUL)            /*!< SAR INJ_RESULT: INJ_RESULT (Bitfield-Mask: 0xffff)        */
#define SAR_INJ_RESULT_INJ_NEWVALUE_Pos   (27UL)                /*!< SAR INJ_RESULT: INJ_NEWVALUE (Bit 27)                     */
#define SAR_INJ_RESULT_INJ_NEWVALUE_Msk   (0x8000000UL)         /*!< SAR INJ_RESULT: INJ_NEWVALUE (Bitfield-Mask: 0x01)        */
#define SAR_INJ_RESULT_INJ_COLLISION_INTR_MIR_Pos (28UL)        /*!< SAR INJ_RESULT: INJ_COLLISION_INTR_MIR (Bit 28)           */
#define SAR_INJ_RESULT_INJ_COLLISION_INTR_MIR_Msk (0x10000000UL) /*!< SAR INJ_RESULT: INJ_COLLISION_INTR_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INJ_RESULT_INJ_SATURATE_INTR_MIR_Pos (29UL)         /*!< SAR INJ_RESULT: INJ_SATURATE_INTR_MIR (Bit 29)            */
#define SAR_INJ_RESULT_INJ_SATURATE_INTR_MIR_Msk (0x20000000UL) /*!< SAR INJ_RESULT: INJ_SATURATE_INTR_MIR (Bitfield-Mask: 0x01)*/
#define SAR_INJ_RESULT_INJ_RANGE_INTR_MIR_Pos (30UL)            /*!< SAR INJ_RESULT: INJ_RANGE_INTR_MIR (Bit 30)               */
#define SAR_INJ_RESULT_INJ_RANGE_INTR_MIR_Msk (0x40000000UL)    /*!< SAR INJ_RESULT: INJ_RANGE_INTR_MIR (Bitfield-Mask: 0x01)  */
#define SAR_INJ_RESULT_INJ_EOC_INTR_MIR_Pos (31UL)              /*!< SAR INJ_RESULT: INJ_EOC_INTR_MIR (Bit 31)                 */
#define SAR_INJ_RESULT_INJ_EOC_INTR_MIR_Msk (0x80000000UL)      /*!< SAR INJ_RESULT: INJ_EOC_INTR_MIR (Bitfield-Mask: 0x01)    */
/* ======================================================  SAR.STATUS  ======================================================= */
#define SAR_STATUS_CUR_CHAN_Pos           (0UL)                 /*!< SAR STATUS: CUR_CHAN (Bit 0)                              */
#define SAR_STATUS_CUR_CHAN_Msk           (0x1fUL)              /*!< SAR STATUS: CUR_CHAN (Bitfield-Mask: 0x1f)                */
#define SAR_STATUS_SW_VREF_NEG_Pos        (30UL)                /*!< SAR STATUS: SW_VREF_NEG (Bit 30)                          */
#define SAR_STATUS_SW_VREF_NEG_Msk        (0x40000000UL)        /*!< SAR STATUS: SW_VREF_NEG (Bitfield-Mask: 0x01)             */
#define SAR_STATUS_BUSY_Pos               (31UL)                /*!< SAR STATUS: BUSY (Bit 31)                                 */
#define SAR_STATUS_BUSY_Msk               (0x80000000UL)        /*!< SAR STATUS: BUSY (Bitfield-Mask: 0x01)                    */
/* =====================================================  SAR.AVG_STAT  ====================================================== */
#define SAR_AVG_STAT_CUR_AVG_ACCU_Pos     (0UL)                 /*!< SAR AVG_STAT: CUR_AVG_ACCU (Bit 0)                        */
#define SAR_AVG_STAT_CUR_AVG_ACCU_Msk     (0xfffffUL)           /*!< SAR AVG_STAT: CUR_AVG_ACCU (Bitfield-Mask: 0xfffff)       */
#define SAR_AVG_STAT_INTRLV_BUSY_Pos      (23UL)                /*!< SAR AVG_STAT: INTRLV_BUSY (Bit 23)                        */
#define SAR_AVG_STAT_INTRLV_BUSY_Msk      (0x800000UL)          /*!< SAR AVG_STAT: INTRLV_BUSY (Bitfield-Mask: 0x01)           */
#define SAR_AVG_STAT_CUR_AVG_CNT_Pos      (24UL)                /*!< SAR AVG_STAT: CUR_AVG_CNT (Bit 24)                        */
#define SAR_AVG_STAT_CUR_AVG_CNT_Msk      (0xff000000UL)        /*!< SAR AVG_STAT: CUR_AVG_CNT (Bitfield-Mask: 0xff)           */
/* ====================================================  SAR.MUX_SWITCH0  ==================================================== */
#define SAR_MUX_SWITCH0_MUX_FW_P0_VPLUS_Pos (0UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P0_VPLUS (Bit 0)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P0_VPLUS_Msk (0x1UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P0_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P1_VPLUS_Pos (1UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P1_VPLUS (Bit 1)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P1_VPLUS_Msk (0x2UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P1_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P2_VPLUS_Pos (2UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P2_VPLUS (Bit 2)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P2_VPLUS_Msk (0x4UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P2_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P3_VPLUS_Pos (3UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P3_VPLUS (Bit 3)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P3_VPLUS_Msk (0x8UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P3_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P4_VPLUS_Pos (4UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P4_VPLUS (Bit 4)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P4_VPLUS_Msk (0x10UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P4_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P5_VPLUS_Pos (5UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P5_VPLUS (Bit 5)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P5_VPLUS_Msk (0x20UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P5_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P6_VPLUS_Pos (6UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P6_VPLUS (Bit 6)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P6_VPLUS_Msk (0x40UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P6_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P7_VPLUS_Pos (7UL)               /*!< SAR MUX_SWITCH0: MUX_FW_P7_VPLUS (Bit 7)                  */
#define SAR_MUX_SWITCH0_MUX_FW_P7_VPLUS_Msk (0x80UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P7_VPLUS (Bitfield-Mask: 0x01)    */
#define SAR_MUX_SWITCH0_MUX_FW_P0_VMINUS_Pos (8UL)              /*!< SAR MUX_SWITCH0: MUX_FW_P0_VMINUS (Bit 8)                 */
#define SAR_MUX_SWITCH0_MUX_FW_P0_VMINUS_Msk (0x100UL)          /*!< SAR MUX_SWITCH0: MUX_FW_P0_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P1_VMINUS_Pos (9UL)              /*!< SAR MUX_SWITCH0: MUX_FW_P1_VMINUS (Bit 9)                 */
#define SAR_MUX_SWITCH0_MUX_FW_P1_VMINUS_Msk (0x200UL)          /*!< SAR MUX_SWITCH0: MUX_FW_P1_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P2_VMINUS_Pos (10UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P2_VMINUS (Bit 10)                */
#define SAR_MUX_SWITCH0_MUX_FW_P2_VMINUS_Msk (0x400UL)          /*!< SAR MUX_SWITCH0: MUX_FW_P2_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P3_VMINUS_Pos (11UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P3_VMINUS (Bit 11)                */
#define SAR_MUX_SWITCH0_MUX_FW_P3_VMINUS_Msk (0x800UL)          /*!< SAR MUX_SWITCH0: MUX_FW_P3_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P4_VMINUS_Pos (12UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P4_VMINUS (Bit 12)                */
#define SAR_MUX_SWITCH0_MUX_FW_P4_VMINUS_Msk (0x1000UL)         /*!< SAR MUX_SWITCH0: MUX_FW_P4_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P5_VMINUS_Pos (13UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P5_VMINUS (Bit 13)                */
#define SAR_MUX_SWITCH0_MUX_FW_P5_VMINUS_Msk (0x2000UL)         /*!< SAR MUX_SWITCH0: MUX_FW_P5_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P6_VMINUS_Pos (14UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P6_VMINUS (Bit 14)                */
#define SAR_MUX_SWITCH0_MUX_FW_P6_VMINUS_Msk (0x4000UL)         /*!< SAR MUX_SWITCH0: MUX_FW_P6_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_P7_VMINUS_Pos (15UL)             /*!< SAR MUX_SWITCH0: MUX_FW_P7_VMINUS (Bit 15)                */
#define SAR_MUX_SWITCH0_MUX_FW_P7_VMINUS_Msk (0x8000UL)         /*!< SAR MUX_SWITCH0: MUX_FW_P7_VMINUS (Bitfield-Mask: 0x01)   */
#define SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Pos (16UL)           /*!< SAR MUX_SWITCH0: MUX_FW_VSSA_VMINUS (Bit 16)              */
#define SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Msk (0x10000UL)      /*!< SAR MUX_SWITCH0: MUX_FW_VSSA_VMINUS (Bitfield-Mask: 0x01) */
#define SAR_MUX_SWITCH0_MUX_FW_TEMP_VPLUS_Pos (17UL)            /*!< SAR MUX_SWITCH0: MUX_FW_TEMP_VPLUS (Bit 17)               */
#define SAR_MUX_SWITCH0_MUX_FW_TEMP_VPLUS_Msk (0x20000UL)       /*!< SAR MUX_SWITCH0: MUX_FW_TEMP_VPLUS (Bitfield-Mask: 0x01)  */
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSA_VPLUS_Pos (18UL)        /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSA_VPLUS (Bit 18)           */
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSA_VPLUS_Msk (0x40000UL)   /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSA_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSB_VPLUS_Pos (19UL)        /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSB_VPLUS (Bit 19)           */
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSB_VPLUS_Msk (0x80000UL)   /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSB_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSA_VMINUS_Pos (20UL)       /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSA_VMINUS (Bit 20)          */
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSA_VMINUS_Msk (0x100000UL) /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSA_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSB_VMINUS_Pos (21UL)       /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSB_VMINUS (Bit 21)          */
#define SAR_MUX_SWITCH0_MUX_FW_AMUXBUSB_VMINUS_Msk (0x200000UL) /*!< SAR MUX_SWITCH0: MUX_FW_AMUXBUSB_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS0_VPLUS_Pos (22UL)         /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS0_VPLUS (Bit 22)            */
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS0_VPLUS_Msk (0x400000UL)   /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS0_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS1_VPLUS_Pos (23UL)         /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS1_VPLUS (Bit 23)            */
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS1_VPLUS_Msk (0x800000UL)   /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS1_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS0_VMINUS_Pos (24UL)        /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS0_VMINUS (Bit 24)           */
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS0_VMINUS_Msk (0x1000000UL) /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS0_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS1_VMINUS_Pos (25UL)        /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS1_VMINUS (Bit 25)           */
#define SAR_MUX_SWITCH0_MUX_FW_SARBUS1_VMINUS_Msk (0x2000000UL) /*!< SAR MUX_SWITCH0: MUX_FW_SARBUS1_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH0_MUX_FW_P4_COREIO0_Pos (26UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P4_COREIO0 (Bit 26)               */
#define SAR_MUX_SWITCH0_MUX_FW_P4_COREIO0_Msk (0x4000000UL)     /*!< SAR MUX_SWITCH0: MUX_FW_P4_COREIO0 (Bitfield-Mask: 0x01)  */
#define SAR_MUX_SWITCH0_MUX_FW_P5_COREIO1_Pos (27UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P5_COREIO1 (Bit 27)               */
#define SAR_MUX_SWITCH0_MUX_FW_P5_COREIO1_Msk (0x8000000UL)     /*!< SAR MUX_SWITCH0: MUX_FW_P5_COREIO1 (Bitfield-Mask: 0x01)  */
#define SAR_MUX_SWITCH0_MUX_FW_P6_COREIO2_Pos (28UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P6_COREIO2 (Bit 28)               */
#define SAR_MUX_SWITCH0_MUX_FW_P6_COREIO2_Msk (0x10000000UL)    /*!< SAR MUX_SWITCH0: MUX_FW_P6_COREIO2 (Bitfield-Mask: 0x01)  */
#define SAR_MUX_SWITCH0_MUX_FW_P7_COREIO3_Pos (29UL)            /*!< SAR MUX_SWITCH0: MUX_FW_P7_COREIO3 (Bit 29)               */
#define SAR_MUX_SWITCH0_MUX_FW_P7_COREIO3_Msk (0x20000000UL)    /*!< SAR MUX_SWITCH0: MUX_FW_P7_COREIO3 (Bitfield-Mask: 0x01)  */
/* =================================================  SAR.MUX_SWITCH_CLEAR0  ================================================= */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P0_VPLUS_Pos (0UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P0_VPLUS (Bit 0)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P0_VPLUS_Msk (0x1UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P0_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P1_VPLUS_Pos (1UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P1_VPLUS (Bit 1)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P1_VPLUS_Msk (0x2UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P1_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P2_VPLUS_Pos (2UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P2_VPLUS (Bit 2)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P2_VPLUS_Msk (0x4UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P2_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P3_VPLUS_Pos (3UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P3_VPLUS (Bit 3)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P3_VPLUS_Msk (0x8UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P3_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_VPLUS_Pos (4UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_VPLUS (Bit 4)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_VPLUS_Msk (0x10UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_VPLUS_Pos (5UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_VPLUS (Bit 5)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_VPLUS_Msk (0x20UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_VPLUS (Bitfield-Mask: 0x01)*/
