ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_sar.h
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_VPLUS_Pos (6UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_VPLUS (Bit 6)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_VPLUS_Msk (0x40UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_VPLUS_Pos (7UL)         /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_VPLUS (Bit 7)            */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_VPLUS_Msk (0x80UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P0_VMINUS_Pos (8UL)        /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P0_VMINUS (Bit 8)           */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P0_VMINUS_Msk (0x100UL)    /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P0_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P1_VMINUS_Pos (9UL)        /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P1_VMINUS (Bit 9)           */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P1_VMINUS_Msk (0x200UL)    /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P1_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P2_VMINUS_Pos (10UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P2_VMINUS (Bit 10)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P2_VMINUS_Msk (0x400UL)    /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P2_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P3_VMINUS_Pos (11UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P3_VMINUS (Bit 11)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P3_VMINUS_Msk (0x800UL)    /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P3_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_VMINUS_Pos (12UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_VMINUS (Bit 12)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_VMINUS_Msk (0x1000UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_VMINUS_Pos (13UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_VMINUS (Bit 13)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_VMINUS_Msk (0x2000UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_VMINUS_Pos (14UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_VMINUS (Bit 14)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_VMINUS_Msk (0x4000UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_VMINUS_Pos (15UL)       /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_VMINUS (Bit 15)          */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_VMINUS_Msk (0x8000UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_VSSA_VMINUS_Pos (16UL)     /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_VSSA_VMINUS (Bit 16)        */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_VSSA_VMINUS_Msk (0x10000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_VSSA_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_TEMP_VPLUS_Pos (17UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_TEMP_VPLUS (Bit 17)         */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_TEMP_VPLUS_Msk (0x20000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_TEMP_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSA_VPLUS_Pos (18UL)  /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSA_VPLUS (Bit 18)     */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSA_VPLUS_Msk (0x40000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSA_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSB_VPLUS_Pos (19UL)  /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSB_VPLUS (Bit 19)     */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSB_VPLUS_Msk (0x80000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSB_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSA_VMINUS_Pos (20UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSA_VMINUS (Bit 20)    */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSA_VMINUS_Msk (0x100000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSA_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSB_VMINUS_Pos (21UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSB_VMINUS (Bit 21)    */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_AMUXBUSB_VMINUS_Msk (0x200000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_AMUXBUSB_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS0_VPLUS_Pos (22UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS0_VPLUS (Bit 22)      */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS0_VPLUS_Msk (0x400000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS0_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS1_VPLUS_Pos (23UL)   /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS1_VPLUS (Bit 23)      */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS1_VPLUS_Msk (0x800000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS1_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS0_VMINUS_Pos (24UL)  /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS0_VMINUS (Bit 24)     */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS0_VMINUS_Msk (0x1000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS0_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS1_VMINUS_Pos (25UL)  /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS1_VMINUS (Bit 25)     */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_SARBUS1_VMINUS_Msk (0x2000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_SARBUS1_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_COREIO0_Pos (26UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_COREIO0 (Bit 26)         */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P4_COREIO0_Msk (0x4000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P4_COREIO0 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_COREIO1_Pos (27UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_COREIO1 (Bit 27)         */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P5_COREIO1_Msk (0x8000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P5_COREIO1 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_COREIO2_Pos (28UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_COREIO2 (Bit 28)         */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P6_COREIO2_Msk (0x10000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P6_COREIO2 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_COREIO3_Pos (29UL)      /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_COREIO3 (Bit 29)         */
#define SAR_MUX_SWITCH_CLEAR0_MUX_FW_P7_COREIO3_Msk (0x20000000UL) /*!< SAR MUX_SWITCH_CLEAR0: MUX_FW_P7_COREIO3 (Bitfield-Mask: 0x01)*/
/* ================================================  SAR.MUX_SWITCH_DS_CTRL  ================================================= */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P0_Pos (0UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P0 (Bit 0)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P0_Msk (0x1UL)       /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P0 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P1_Pos (1UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P1 (Bit 1)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P1_Msk (0x2UL)       /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P1 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P2_Pos (2UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P2 (Bit 2)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P2_Msk (0x4UL)       /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P2 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P3_Pos (3UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P3 (Bit 3)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P3_Msk (0x8UL)       /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P3 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P4_Pos (4UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P4 (Bit 4)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P4_Msk (0x10UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P4 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P5_Pos (5UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P5 (Bit 5)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P5_Msk (0x20UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P5 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P6_Pos (6UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P6 (Bit 6)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P6_Msk (0x40UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P6 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P7_Pos (7UL)         /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P7 (Bit 7)            */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_P7_Msk (0x80UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_P7 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_VSSA_Pos (16UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_VSSA (Bit 16)         */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_VSSA_Msk (0x10000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_VSSA (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_TEMP_Pos (17UL)      /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_TEMP (Bit 17)         */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_TEMP_Msk (0x20000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_TEMP (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_AMUXBUSA_Pos (18UL)  /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_AMUXBUSA (Bit 18)     */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_AMUXBUSA_Msk (0x40000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_AMUXBUSA (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_AMUXBUSB_Pos (19UL)  /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_AMUXBUSB (Bit 19)     */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_AMUXBUSB_Msk (0x80000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_AMUXBUSB (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_SARBUS0_Pos (22UL)   /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_SARBUS0 (Bit 22)      */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_SARBUS0_Msk (0x400000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_SARBUS0 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_SARBUS1_Pos (23UL)   /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_SARBUS1 (Bit 23)      */
#define SAR_MUX_SWITCH_DS_CTRL_MUX_DS_CTRL_SARBUS1_Msk (0x800000UL) /*!< SAR MUX_SWITCH_DS_CTRL: MUX_DS_CTRL_SARBUS1 (Bitfield-Mask: 0x01)*/
/* ================================================  SAR.MUX_SWITCH_SQ_CTRL  ================================================= */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P0_Pos (0UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P0 (Bit 0)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P0_Msk (0x1UL)       /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P0 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P1_Pos (1UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P1 (Bit 1)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P1_Msk (0x2UL)       /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P1 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P2_Pos (2UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P2 (Bit 2)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P2_Msk (0x4UL)       /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P2 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P3_Pos (3UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P3 (Bit 3)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P3_Msk (0x8UL)       /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P3 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P4_Pos (4UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P4 (Bit 4)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P4_Msk (0x10UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P4 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P5_Pos (5UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P5 (Bit 5)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P5_Msk (0x20UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P5 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P6_Pos (6UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P6 (Bit 6)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P6_Msk (0x40UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P6 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P7_Pos (7UL)         /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P7 (Bit 7)            */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_P7_Msk (0x80UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_P7 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_VSSA_Pos (16UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_VSSA (Bit 16)         */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_VSSA_Msk (0x10000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_VSSA (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_TEMP_Pos (17UL)      /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_TEMP (Bit 17)         */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_TEMP_Msk (0x20000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_TEMP (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_AMUXBUSA_Pos (18UL)  /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_AMUXBUSA (Bit 18)     */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_AMUXBUSA_Msk (0x40000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_AMUXBUSA (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_AMUXBUSB_Pos (19UL)  /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_AMUXBUSB (Bit 19)     */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_AMUXBUSB_Msk (0x80000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_AMUXBUSB (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_SARBUS0_Pos (22UL)   /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_SARBUS0 (Bit 22)      */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_SARBUS0_Msk (0x400000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_SARBUS0 (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_SARBUS1_Pos (23UL)   /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_SARBUS1 (Bit 23)      */
#define SAR_MUX_SWITCH_SQ_CTRL_MUX_SQ_CTRL_SARBUS1_Msk (0x800000UL) /*!< SAR MUX_SWITCH_SQ_CTRL: MUX_SQ_CTRL_SARBUS1 (Bitfield-Mask: 0x01)*/
/* =================================================  SAR.MUX_SWITCH_STATUS  ================================================= */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VPLUS_Pos (0UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P0_VPLUS (Bit 0)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VPLUS_Msk (0x1UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P0_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VPLUS_Pos (1UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P1_VPLUS (Bit 1)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VPLUS_Msk (0x2UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P1_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VPLUS_Pos (2UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P2_VPLUS (Bit 2)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VPLUS_Msk (0x4UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P2_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VPLUS_Pos (3UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P3_VPLUS (Bit 3)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VPLUS_Msk (0x8UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P3_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VPLUS_Pos (4UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P4_VPLUS (Bit 4)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VPLUS_Msk (0x10UL)      /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P4_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VPLUS_Pos (5UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P5_VPLUS (Bit 5)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VPLUS_Msk (0x20UL)      /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P5_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VPLUS_Pos (6UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P6_VPLUS (Bit 6)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VPLUS_Msk (0x40UL)      /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P6_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VPLUS_Pos (7UL)         /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P7_VPLUS (Bit 7)            */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VPLUS_Msk (0x80UL)      /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P7_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VMINUS_Pos (8UL)        /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P0_VMINUS (Bit 8)           */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VMINUS_Msk (0x100UL)    /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P0_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VMINUS_Pos (9UL)        /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P1_VMINUS (Bit 9)           */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VMINUS_Msk (0x200UL)    /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P1_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VMINUS_Pos (10UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P2_VMINUS (Bit 10)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VMINUS_Msk (0x400UL)    /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P2_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VMINUS_Pos (11UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P3_VMINUS (Bit 11)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VMINUS_Msk (0x800UL)    /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P3_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VMINUS_Pos (12UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P4_VMINUS (Bit 12)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VMINUS_Msk (0x1000UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P4_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VMINUS_Pos (13UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P5_VMINUS (Bit 13)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VMINUS_Msk (0x2000UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P5_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VMINUS_Pos (14UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P6_VMINUS (Bit 14)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VMINUS_Msk (0x4000UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P6_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VMINUS_Pos (15UL)       /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P7_VMINUS (Bit 15)          */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VMINUS_Msk (0x8000UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_P7_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_VSSA_VMINUS_Pos (16UL)     /*!< SAR MUX_SWITCH_STATUS: MUX_FW_VSSA_VMINUS (Bit 16)        */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_VSSA_VMINUS_Msk (0x10000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_VSSA_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_TEMP_VPLUS_Pos (17UL)      /*!< SAR MUX_SWITCH_STATUS: MUX_FW_TEMP_VPLUS (Bit 17)         */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_TEMP_VPLUS_Msk (0x20000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_TEMP_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VPLUS_Pos (18UL)  /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSA_VPLUS (Bit 18)     */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VPLUS_Msk (0x40000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSA_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VPLUS_Pos (19UL)  /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSB_VPLUS (Bit 19)     */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VPLUS_Msk (0x80000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSB_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VMINUS_Pos (20UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSA_VMINUS (Bit 20)    */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VMINUS_Msk (0x100000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSA_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VMINUS_Pos (21UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSB_VMINUS (Bit 21)    */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VMINUS_Msk (0x200000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_AMUXBUSB_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VPLUS_Pos (22UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS0_VPLUS (Bit 22)      */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VPLUS_Msk (0x400000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS0_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VPLUS_Pos (23UL)   /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS1_VPLUS (Bit 23)      */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VPLUS_Msk (0x800000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS1_VPLUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VMINUS_Pos (24UL)  /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS0_VMINUS (Bit 24)     */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VMINUS_Msk (0x1000000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS0_VMINUS (Bitfield-Mask: 0x01)*/
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VMINUS_Pos (25UL)  /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS1_VMINUS (Bit 25)     */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VMINUS_Msk (0x2000000UL) /*!< SAR MUX_SWITCH_STATUS: MUX_FW_SARBUS1_VMINUS (Bitfield-Mask: 0x01)*/
/* =====================================================  SAR.ANA_TRIM0  ===================================================== */
#define SAR_ANA_TRIM0_CAP_TRIM_Pos        (0UL)                 /*!< SAR ANA_TRIM0: CAP_TRIM (Bit 0)                           */
#define SAR_ANA_TRIM0_CAP_TRIM_Msk        (0x1fUL)              /*!< SAR ANA_TRIM0: CAP_TRIM (Bitfield-Mask: 0x1f)             */
#define SAR_ANA_TRIM0_TRIMUNIT_Pos        (5UL)                 /*!< SAR ANA_TRIM0: TRIMUNIT (Bit 5)                           */
#define SAR_ANA_TRIM0_TRIMUNIT_Msk        (0x20UL)              /*!< SAR ANA_TRIM0: TRIMUNIT (Bitfield-Mask: 0x01)             */
/* =====================================================  SAR.ANA_TRIM1  ===================================================== */
#define SAR_ANA_TRIM1_SAR_REF_BUF_TRIM_Pos (0UL)                /*!< SAR ANA_TRIM1: SAR_REF_BUF_TRIM (Bit 0)                   */
#define SAR_ANA_TRIM1_SAR_REF_BUF_TRIM_Msk (0x3fUL)             /*!< SAR ANA_TRIM1: SAR_REF_BUF_TRIM (Bitfield-Mask: 0x3f)     */


#endif /* _CYIP_SAR_H_ */


/* [] END OF FILE */
